#include <stdio.h>
#include <stdlib.h>
#include <locale>
//Підключення бібліотек

void swap(int* a, int* b) { //Функція для перемішування елементів 
    int temp = *a;
    *a = *b;
    *b = temp;
}

void sortArray(int* arr, int size) { //Функція сортування масиву
    for (int i = 0; i < size - 1; ++i) { //Подвійний цикл, після кожної строчки ми проробляємо так ще ту саму кількість разів, скільки елементів в масиві для правильного сортування
        for (int j = 0; j < size - 1; ++j) {
            if (arr[j] > arr[j + 1]) {
                swap(&arr[j], &arr[j + 1]);//Викликаємо функцію обміну елементами
            }
        }
    }
}

int main() {
    setlocale(LC_CTYPE, "ukr"); //Українізація

    int size;
    do { //Введення розміру масиву з циклом післяумовою, яка перевіряє чи не є розмір масиву меньше за 0
        printf("Введiть розмiр масиву: ");
        scanf_s("%d", &size);
    } while (size <= 0);

    int* arr = (int*)malloc(size * sizeof(int)); //Створення динамічної комірки пам'яті для масиву елементів

    printf("Введiть елементи масиву:\n"); //Введення елементів до пустого масиву за допомогою циклу
    for (int i = 0; i < size; ++i) {
        printf("Елемент %d: ", i + 1);
        scanf_s("%d", &arr[i]);
    }

    sortArray(arr, size); // Сортування масиву

    printf("\nМiнiмальне значення: %d\n", arr[0]); // Виводимо результати
    printf("Максимальне значення: %d\n", arr[size - 1]);

    free(arr); //Звільнення динамічної комірки пам'яті 
    return 0;
}
